_wiki/2015-07-31-offline-distribution-package-repo.html
---
collections: wiki
layout: post
title: Offline Distribution Package Repo
date: 2015-07-31
categories: 
-
tags: 
- offline
- repo
author: carltonf
excerpt: 
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Ubuntu/Debian</h2>
<div class="outline-text-2" id="text-1">
<p>
Reference files can be found at <a href="https://github.com/carltonf/configurations/tree/master/offline_distro_pkg_repo/ubuntu_debian">offline-repo-confs</a>.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">preparation</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>define an offline repo location
add it to the top of the source list
<code>deb file:///opt/ubuntu_offline_repo/ oneiric main restricted multiverse universe</code>
</li>
<li>populate the above directory
<ul class="org-ul">
<li>the key here is to simulate the file system hierarchy of an ubuntu mirror
</li>
<li>download files with 'init<sub>setup</sub>.bat'
</li>
<li>copy to corresponding directory in the local repo
</li>
<li>apt-get update
</li>
</ul>
</li>
<li>the local repo is ready to be used, searched and generate dependencies.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">how to use</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>copy files in <b>in<sub>linux</sub></b> to the local repo (or other places e.g. <i>root</i>)
</li>
<li>you can accumulate the package to install to a separate file. (find them through apt-cache search)
the 'todo.txt' is and example
</li>
<li>run <b>./gen<sub>list</sub>.sh</b> to generate <b>apt<sub>list</sub></b> (see <b>./gen<sub>list</sub>.sh</b> to see usage)
</li>
<li>copy <b>apt<sub>list</sub></b> to pen disk to windows box with Internet
</li>
<li>run <code>wget.exe -i apt_list</code> to download
</li>
<li>copy all <b>deb</b> files downloaded to <code>/var/cache/apt/archives/</code>
</li>
<li><code>apt-get install &lt;packages&gt;</code>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="todo TODO">TODO</span> openSUSE &amp; Arch tips should be included.</h2>
</div>
